aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
/* Copyright (c) 2010 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "app_sensor_utils.h"

#include <stdint.h>

#include "nrf_mesh_assert.h"
#include "log.h"

#include "access_config.h"
#include "mesh_mem.h"

#include "sensor_common.h"
#include "sensor_utils.h"


/** Structures and constants for the sensor cadence */
#define CADENCE_DIVISOR_MASK (0x7F)
#define CADENCE_TRIGGER_MASK (0x1)
#define CADENCE_TRIGGER_SHIFT (7)

#define MPID_A_MAX_DATA_BYTES (16)
#define FORMAT_A_MAX_PROPERTY_ID (2047)
#define FORMAT_MASK (0x01)

/* 4 bytes in the non-variable part of the cadence cmd */
#define SERIALIZED_CADENCE_SCALAR_BYTES (4)
#define SERIALIZED_CADENCE_DELTA_VECTORS (2)
#define SERIALIZED_CADENCE_VALUE_VECTORS (2)

#define MAXIMUM_MINIMUM_STATUS_INTERVAL_VALUE (26)
#define MAXIMIM_FAST_CADENCE_PERIOD_DIVISOR_VALUE (15)

static uint64_t m_minimum_publish_interval;
static uint8_t * mp_marshalled_data;

/* static function definitions.
 */
static uint16_t range_vector_bytes_get(uint16_t property_id)
{
    switch (property_id) {

#ifdef SENSOR_MOTION_SENSED_ENABLE
    case SENSOR_MOTION_SENSED_PROPERTY_ID:   /* Intentionally fall through. */
        return sizeof(chr_percentage8_t);
#endif /* SENSOR_MOTION_SENSED_ENABLE */

#ifdef SENSOR_PRESENCE_DETECT_ENABLE
    case SENSOR_PRESENCE_DETECT_PROPERTY_ID:
        return sizeof(chr_boolean_t);
#endif /* SENSOR_PRESENCE_DETECT_ENABLE */

#ifdef SENSOR_PRESENT_AMBIENT_TEMPERATURE_ENABLE
    case SENSOR_PRESENT_AMBIENT_TEMPERATURE_PROPERTY_ID:
        return sizeof(chr_temperature8_t);
#endif /* SENSOR_PRESENT_AMBIENT_TEMPERATURE_ENABLE */

#ifdef SENSOR_PRESENT_DEVICE_INPUT_POWER_ENABLE
    case SENSOR_PRESENT_DEVICE_INPUT_POWER_PROPERTY_ID:
        return 3;   /* sizeof(uint24_t)  */
#endif /* SENSOR_PRESENT_DEVICE_INPUT_POWER_ENABLE */

#ifdef SENSOR_PRESENT_INPUT_CURRENT_ENABLE
    case SENSOR_PRESENT_INPUT_CURRENT_PROPERTY_ID:
        return sizeof(chr_electric_current_t);
#endif /* SENSOR_PRESENT_INPUT_CURRENT_ENABLE */

#ifdef SENSOR_PRESENT_INPUT_VOLTAGE_ENABLE
    case SENSOR_PRESENT_INPUT_VOLTAGE_PROPERTY_ID:
        return sizeof(chr_voltage_t);
#endif /* SENSOR_PRESENT_INPUT_VOLTAGE_ENABLE */

#ifdef SENSOR_DESIRED_AMBIENT_TEMPERATURE_ENABLE
    case SENSOR_DESIRED_AMBIENT_TEMPERATURE_PROPERTY_ID:
        return sizeof(chr_temperature8_t);
#endif /* SENSOR_DESIRED_AMBIENT_TEMPERATURE_ENABLE */

#ifdef SENSOR_PRECISE_TOTAL_DEVICE_ENERGY_USE_ENABLE
    case SENSOR_PRECISE_TOTAL_DEVICE_ENERGY_USE_PROPERTY_ID:
        return sizeof(chr_energy32_t);
#endif /* SENSOR_PRECISE_TOTAL_DEVICE_ENERGY_USE_ENABLE */

#ifdef SENSOR_PRECISE_PRESENT_AMBIENT_TEMPERATURE_ENABLE
    case SENSOR_PRECISE_PRESENT_AMBIENT_TEMPERATURE_PROPERTY_ID:
        return sizeof(chr_temperature_t);
#endif /* SENSOR_PRECISE_PRESENT_AMBIENT_TEMPERATURE_ENABLE */

#ifdef SENSOR_PRESENT_AMBIENT_RELATIVE_HUMIDITY_ENABLE
    case SENSOR_PRESENT_AMBIENT_RELATIVE_HUMIDITY_PROPERTY_ID:
        return sizeof(chr_temperature_t);
#endif /* SENSOR_PRESENT_AMBIENT_RELATIVE_HUMIDITY_ENABLE */

#ifdef SENSOR_PRESENT_INDOOR_RELATIVE_HUMIDITY_ENABLE
    case SENSOR_PRESENT_INDOOR_RELATIVE_HUMIDITY_PROPERTY_ID:
        return sizeof(chr_temperature_t);
#endif /* SENSOR_PRESENT_INDOOR_RELATIVE_HUMIDITY_ENABLE */

#ifdef SENSOR_PRESENT_OUTDOOR_RELATIVE_HUMIDITY_ENABLE
    case SENSOR_PRESENT_OUTDOOR_RELATIVE_HUMIDITY_PROPERTY_ID:
        return sizeof(chr_temperature_t);
#endif /* SENSOR_PRESENT_OUTDOOR_RELATIVE_HUMIDITY_ENABLE */

    default:
        /* Property ID not supported */
        return 0;
    }
}

static uint16_t delta_vector_bytes_get(uint16_t property_id, uint8_t trigger_type)
{
    uint16_t range_vector_bytes = range_vector_bytes_get(property_id);
    if (range_vector_bytes == 0) {
        /* Property ID not supported */
        return 0;
    }
    return trigger_type ? sizeof(uint16_t) : range_vector_bytes;
}

static inline uint16_t delta_vector_bytes_allocated_get(uint16_t property_id)
{
    uint16_t bytes_trigger_type_0 = delta_vector_bytes_get(property_id, 0);
    uint16_t bytes_trigger_type_1 = delta_vector_bytes_get(property_id, 1);
    return MAX(bytes_trigger_type_0, bytes_trigger_type_1);
}

static uint16_t cadence_serialized_bytes(sensor_cadence_t * p)
{
    /*                                            bits     bytes
     * Property ID 16 Property ID for the sensor. 16         2
     * Fast Cadence Period Divisor                 7
     * Status Trigger Type                         1         1
     * Status Trigger Delta Down variable        variable   vector
     * Status Trigger Delta Up variable          variable   vector
     * Status Min Interval                         8         1
     * Fast Cadence Low variable                 variable   vector
     * Fast Cadence High variable                varaible   vector
    */

    /* 4.1.3.2
     *  Status Trigger Type:
     *  The Status Trigger Type field shall define the unit and format of the Status Trigger Delta Down
     *  and the Status Trigger Delta Up fields.
     *    -  The value of 0b0 means that the format shall be defined by the Format Type of the
     *       characteristic that the Sensor Property ID state references (see Section 4.1.1.1).
     *    -  The value of 0b1 means that the unit is «unitless», the format type is 0x06 (uint16), and the
     *       value is represented as a percentage change with a resolution of 0.01 percent.
     */

    return SERIALIZED_CADENCE_SCALAR_BYTES
        + SERIALIZED_CADENCE_DELTA_VECTORS * delta_vector_bytes_get(p->property_id, p->trigger_type)
        + SERIALIZED_CADENCE_VALUE_VECTORS * p->range_value_bytes_allocated;
}

static uint32_t cadence_update(sensor_cadence_t * p, uint8_t * p_in, uint16_t bytes)
{
    if (p == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if (bytes <= sizeof(uint16_t))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    /* The serialized data at p_in begins with a property id.
     */

    uint16_t property_id;
    memcpy(&property_id, p_in, sizeof(uint16_t));

