aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
    if (property_id != p->property_id)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
              "ERR: the cadence instance ID (%d) != update ID (%d)\n",
              p->property_id,
              property_id);
        return NRF_ERROR_INVALID_DATA;
    }

    /* Consider data after the property id as a uint8_t array.
     */
    bytes -= sizeof(uint16_t);
    uint16_t offset = 0;
    p_in = &p_in[sizeof(uint16_t)];

    /* 4.1.3.1 Fast Cadence Period Divisor:
     * "The valid range for the Fast Cadence Period Divisor state is 0–15 and other values are
     * Prohibited."
     */
    if ((p_in[offset] & CADENCE_DIVISOR_MASK) > MAXIMIM_FAST_CADENCE_PERIOD_DIVISOR_VALUE)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
              "ERR: prohibited value for cadence divisor ((0x%x (%d), %d) = (value, offset)\n",
              p_in[offset] & CADENCE_DIVISOR_MASK,
              p_in[offset] & CADENCE_DIVISOR_MASK,
              offset);
        return NRF_ERROR_INVALID_DATA;
    }

    uint8_t fast_period_exponent = (p_in[offset] & CADENCE_DIVISOR_MASK);
    uint8_t trigger_type = (p_in[offset++] >> CADENCE_TRIGGER_SHIFT) & CADENCE_TRIGGER_MASK;

    uint16_t delta_vector_bytes = delta_vector_bytes_get(p->property_id, trigger_type);
    if ((offset + delta_vector_bytes) > bytes)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    uint8_t * p_trigger_delta_down = &p_in[offset];
    offset += delta_vector_bytes;

    if ((offset + delta_vector_bytes) > bytes)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    uint8_t * p_trigger_delta_up = &p_in[offset];
    offset += delta_vector_bytes;

    if (offset > bytes)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    /* 4.1.3.5 Status Min Interval:
     * "The valid range for the Status Min Interval is 0–26 and other values are Prohibited."
     */
    if (p_in[offset] > MAXIMUM_MINIMUM_STATUS_INTERVAL_VALUE)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
              "ERR: prohibited value for Status Min Interval (0x%x (%d), %d) = (value, offset)\n",
              p_in[offset],
              p_in[offset],
              offset);
        return NRF_ERROR_INVALID_DATA;

    }
    uint8_t min_interval_exponent = p_in[offset++];

    if ((offset + p->range_value_bytes_allocated) > bytes)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    uint8_t * p_fast_cadence_low = &p_in[offset];
    offset += p->range_value_bytes_allocated;

    if ((offset + p->range_value_bytes_allocated) > bytes)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    uint8_t * p_fast_cadence_high = &p_in[offset];


    p->fast_period_exponent  = fast_period_exponent;
    p->trigger_type          = trigger_type;
    memcpy(p->p_trigger_delta_down, p_trigger_delta_down, delta_vector_bytes);
    memcpy(p->p_trigger_delta_up,   p_trigger_delta_up,   delta_vector_bytes);
    p->min_interval_exponent = min_interval_exponent;
    memcpy(p->p_fast_cadence_low,  p_fast_cadence_low,  p->range_value_bytes_allocated);
    memcpy(p->p_fast_cadence_high, p_fast_cadence_high, p->range_value_bytes_allocated);

    return NRF_SUCCESS;
}

#if SENSOR_MOTION_SENSED_ENABLE || SENSOR_PRESENCE_DETECT_ENABLE
static bool chr_uint8_in_fast_region(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    /* Percentage8 data representations specify the current value and the range.
     */
    uint8_t value = *p->p_current_value;

    /* @tagMeshMdlSp Section 4.1.3:
     * "If the Fast Cadence High value is equal or higher than the Fast Cadence Low value, and the
     * measured value is within the closed interval [Fast Cadence Low, Fast Cadence High], the Sensor
     * Status messages are published more frequently."
     *
     * "If the Fast Cadence High value is lower than the Fast Cadence Low value, and the measured
     * value is lower than the Fast Cadence High value or is higher than the Fast Cadence Low value,
     * the Sensor Status messages are published more frequently."
     */
    return  (*p->p_fast_cadence_high >= *p->p_fast_cadence_low)
        ? (value >= *p->p_fast_cadence_low) && (value <= *p->p_fast_cadence_high)
        : (value > *p->p_fast_cadence_low) || (value < *p->p_fast_cadence_high);
}


static bool chr_uint8_delta_value(uint16_t current,
                                  uint16_t previous,
                                  uint8_t  delta_up,
                                  uint8_t  delta_down)
{
    /* "... the format shall be defined by the Format Type of the characteristic that the Sensor
     * Property ID state references (see Section 4.1.1.1)."
     *
     * "The message shall be published when the value of the measured quantity is lower than the
     * previously published value decremented by the value of the Status Trigger Delta Down state
     * (see Section 4.1.3.3) or when it is higher than the previously published value incremented
     * by the value of the Status Trigger Delta Up state (see Section 4.1.3.4)."
     *
     */

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
              "Formatted trigger: current: %u, previous: %u, delta up: %u, delta down: %u, diff: %u\n",
              current, previous, delta_up, delta_down, current > previous ? current - previous : previous - current);

    return (current > previous) ? ((current - previous) >= delta_up)
                                : ((previous - current) >= delta_down);
}

static bool chr_uint8_delta_percent(uint16_t current,
                                    uint16_t previous,
                                    uint16_t delta_up,
                                    uint16_t delta_down)
{
    if (!previous)
    {
        return true;
    }

    uint16_t trigger;
    uint16_t difference;

    if (previous > current)
    {
        trigger = delta_down;
        difference = previous - current;
    }
    else
    {
        trigger = delta_up;
        difference = current - previous;
    }

    uint16_t diff_percentage = 100 * ((100 * difference) / previous);

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
          "Unitless trigger: current: %u, previous: %u, delta up: %u, delta down: %u, diff percentage: %u\n",
          current, previous, delta_up, delta_down, diff_percentage);

    return diff_percentage >= trigger;
}

static bool chr_uint8_delta_trigger_fast(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

