aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
    /*
     * Reference @tagMeshMdlSp, Section 4.1.3:
     * "... the Status Trigger Type (see Section 4.1.3.2), Status Trigger Delta Down (see Section
     * 4.1.3.3), and the Status Trigger Delta Up (see Section 4.1.3.4) ..." values specify fast
     * cadence triggers based upon rate of change.
     */
    if (p->trigger_type)
    {
        /*
         * Section 4.1.3.2:
         * For trigger_type = 1:
         * " ... the unit is "unitless", the format type is 0x06 (uint16), and the value is
         * represented as a percentage change with a resolution of 0.01 percent.
         */
        return chr_uint8_delta_percent((uint16_t)*p->p_current_value,
                                       (uint16_t)*p->p_previous_value,
                                       *(uint16_t *)p->p_trigger_delta_up,
                                       *(uint16_t *)p->p_trigger_delta_down);
    }
    else
    {
        /* "... the format shall be defined by the Format Type of the characteristic that the Sensor
         * Property ID state references (see Section 4.1.1.1)."
         */
        return chr_uint8_delta_value((uint16_t)*p->p_current_value,
                                     (uint16_t)*p->p_previous_value,
                                     *p->p_trigger_delta_up,
                                     *p->p_trigger_delta_down);
    }
}
#endif /* SENSOR_MOTION_SENSED_ENABLE || SENSOR_PRESENCE_DETECT_ENABLE */


#if SENSOR_DESIRED_AMBIENT_TEMPERATURE_ENABLE || SENSOR_PRESENT_AMBIENT_TEMPERATURE_ENABLE
static bool chr_int8_in_fast_region(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    /* uint16 value */
    int8_t value = *(int8_t *)p->p_current_value;
    int8_t fast_cadence_low = *(int8_t *)p->p_fast_cadence_low;
    int8_t fast_cadence_high = *(int8_t *)p->p_fast_cadence_high;

    /* @tagMeshMdlSp Section 4.1.3 */
    return  (fast_cadence_high >= fast_cadence_low)
        ? (value >= fast_cadence_low) && (value <= fast_cadence_high)
        : (value > fast_cadence_low) || (value < fast_cadence_high);
}


static bool chr_int8_delta_value(int16_t current,
                                 int16_t previous,
                                 int8_t delta_up,
                                 int8_t delta_down)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Formatted trigger: current: %d, previous: %d, delta up: %d, delta down: %d, diff: %d\n",
        current, previous, delta_up, delta_down, current > previous ? current - previous : previous - current);

    return (current > previous) ? ((current - previous) >= delta_up)
                                : ((previous - current) >= delta_down);
}

static bool chr_int8_delta_percent(int16_t current,
                                   int16_t previous,
                                   uint16_t delta_up,
                                   uint16_t delta_down)
{
    if (!previous) {
        return true;
    }

    uint16_t trigger;
    uint16_t difference;

    if (previous > current) {
        trigger = delta_down;
        difference = previous - current;
    } else {
        trigger = delta_up;
        difference = current - previous;
    }

    int16_t diff_percentage = 100 * ((100 * difference) / previous);

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Unitless trigger: current: %d, previous: %d, delta up: %d, delta down: %d, diff percentage: %d",
        current, previous, delta_up, delta_down, diff_percentage);

    return diff_percentage >= trigger;
}

static bool chr_int8_delta_trigger_fast(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    if (p->trigger_type) {
        return chr_int8_delta_percent(*(int8_t *)p->p_current_value,
                                      *(int8_t *)p->p_previous_value,
                                      *(uint16_t *)p->p_trigger_delta_up,
                                      *(uint16_t *)p->p_trigger_delta_down);
    } else {
        return chr_int8_delta_value(*(int8_t *)p->p_current_value,
                                    *(int8_t *)p->p_previous_value,
                                    *(int8_t *)p->p_trigger_delta_up,
                                    *(int8_t *)p->p_trigger_delta_down);
    }
}
#endif /* SENSOR_DESIRED_AMBIENT_TEMPERATURE_ENABLE || SENSOR_PRESENT_AMBIENT_TEMPERATURE_ENABLE */


#if SENSOR_PRESENT_INPUT_VOLTAGE_ENABLE                 || \
    SENSOR_PRESENT_INPUT_CURRENT_ENABLE                 || \
    SENSOR_PRESENT_AMBIENT_RELATIVE_HUMIDITY_ENABLE     || \
    SENSOR_PRESENT_INDOOR_RELATIVE_HUMIDITY_ENABLE      || \
    SENSOR_PRESENT_OUTDOOR_RELATIVE_HUMIDITY_ENABLE
static bool chr_uint16_in_fast_region(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    /* uint16 value */
    uint16_t value = *(uint16_t *)p->p_current_value;
    uint16_t fast_cadence_low = *(uint16_t *)p->p_fast_cadence_low;
    uint16_t fast_cadence_high = *(uint16_t *)p->p_fast_cadence_high;

    /* @tagMeshMdlSp Section 4.1.3 */
    return  (fast_cadence_high >= fast_cadence_low)
        ? (value >= fast_cadence_low) && (value <= fast_cadence_high)
        : (value > fast_cadence_low) || (value < fast_cadence_high);
}


static bool chr_uint16_delta_value(uint16_t current,
                                   uint16_t previous,
                                   uint16_t delta_up,
                                   uint16_t delta_down)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Formatted trigger: current: %u, previous: %u, delta up: %u, delta down: %u, diff: %u\n",
        current, previous, delta_up, delta_down, current > previous ? current - previous : previous - current);

    return (current > previous) ? ((current - previous) >= delta_up)
                                : ((previous - current) >= delta_down);
}

static bool chr_uint16_delta_percent(uint16_t current,
                                     uint16_t previous,
                                     uint16_t delta_up,
                                     uint16_t delta_down)
{
    if (!previous) {
        return true;
    }

