aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
    uint16_t trigger;
    uint16_t difference;

    if (previous > current) {
        trigger = delta_down;
        difference = previous - current;
    } else {
        trigger = delta_up;
        difference = current - previous;
    }

    uint16_t diff_percentage = 100 * ((100 * difference) / previous);

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Unitless trigger: current: %u, previous: %u, delta up: %u, delta down: %u, diff percentage: %u",
        current, previous, delta_up, delta_down, diff_percentage);

    return diff_percentage >= trigger;
}

static bool chr_uint16_delta_trigger_fast(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    if (p->trigger_type) {
        return chr_uint16_delta_percent(*(uint16_t *)p->p_current_value,
                                        *(uint16_t *)p->p_previous_value,
                                        *(uint16_t *)p->p_trigger_delta_up,
                                        *(uint16_t *)p->p_trigger_delta_down);
    } else {
        return chr_uint16_delta_value(*(uint16_t *)p->p_current_value,
                                      *(uint16_t *)p->p_previous_value,
                                      *(uint16_t *)p->p_trigger_delta_up,
                                      *(uint16_t *)p->p_trigger_delta_down);
    }
}
#endif /* uint16 */


#if SENSOR_PRECISE_PRESENT_AMBIENT_TEMPERATURE_ENABLE
static bool chr_int16_in_fast_region(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    /* uint16 value */
    uint16_t value = *(int16_t *)p->p_current_value;
    uint16_t fast_cadence_low = *(int16_t *)p->p_fast_cadence_low;
    uint16_t fast_cadence_high = *(int16_t *)p->p_fast_cadence_high;

    /* @tagMeshMdlSp Section 4.1.3 */
    return  (fast_cadence_high >= fast_cadence_low)
        ? (value >= fast_cadence_low) && (value <= fast_cadence_high)
        : (value > fast_cadence_low) || (value < fast_cadence_high);
}


static bool chr_int16_delta_value(int16_t current,
                                  int16_t previous,
                                  int16_t delta_up,
                                  int16_t delta_down)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Formatted trigger: current: %d, previous: %d, delta up: %d, delta down: %d, diff: %d\n",
        current, previous, delta_up, delta_down, current > previous ? current - previous : previous - current);

    return (current > previous) ? ((current - previous) >= delta_up)
                                : ((previous - current) >= delta_down);
}

static bool chr_int16_delta_percent(int16_t current,
                                    int16_t previous,
                                    uint16_t delta_up,
                                    uint16_t delta_down)
{
    if (!previous) {
        return true;
    }

    uint16_t trigger;
    uint16_t difference;

    if (previous > current) {
        trigger = delta_down;
        difference = previous - current;
    } else {
        trigger = delta_up;
        difference = current - previous;
    }

    uint16_t diff_percentage = 100 * ((100 * difference) / previous);

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Unitless trigger: current: %d, previous: %d, delta up: %d, delta down: %d, diff percentage: %d",
        current, previous, delta_up, delta_down, diff_percentage);

    return diff_percentage >= trigger;
}

static bool chr_int16_delta_trigger_fast(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    if (p->trigger_type) {
        return chr_int16_delta_percent(*(int16_t *)p->p_current_value,
                                       *(int16_t *)p->p_previous_value,
                                       *(uint16_t *)p->p_trigger_delta_up,
                                       *(uint16_t *)p->p_trigger_delta_down);
    } else {
        return chr_int16_delta_value(*(int16_t *)p->p_current_value,
                                     *(int16_t *)p->p_previous_value,
                                     *(uint16_t *)p->p_trigger_delta_up,
                                     *(uint16_t *)p->p_trigger_delta_down);
    }
}
#endif /* SENSOR_PRECISE_PRESENT_AMBIENT_TEMPERATURE_ENABLE */


#if SENSOR_PRESENT_DEVICE_INPUT_POWER_ENABLE
static bool chr_uint24_in_fast_region(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    /* uint32 value */
    uint32_t value = *(uint32_t *)p->p_current_value & 0x00ffffff;
    uint32_t fast_cadence_low = *(uint32_t *)p->p_fast_cadence_low & 0x00ffffff;
    uint32_t fast_cadence_high = *(uint32_t *)p->p_fast_cadence_high & 0x00ffffff;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "UINT24 In Fast Region: value: %u, low: %u, high: %u, in_fast_region: %d\n",
        value, fast_cadence_low, fast_cadence_high,
        (fast_cadence_high >= fast_cadence_low)
            ? (value >= fast_cadence_low) && (value <= fast_cadence_high)
            : (value > fast_cadence_low) || (value < fast_cadence_high));

    /* @tagMeshMdlSp Section 4.1.3 */
    return  (fast_cadence_high >= fast_cadence_low)
        ? (value >= fast_cadence_low) && (value <= fast_cadence_high)
        : (value > fast_cadence_low) || (value < fast_cadence_high);
}


static bool chr_uint24_delta_value(uint32_t current,
                                   uint32_t previous,
                                   uint32_t delta_up,
                                   uint32_t delta_down)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Formatted trigger: current: %d, previous: %d, delta up: %d, delta down: %d, diff: %d\n",
        current, previous, delta_up, delta_down, current > previous ? current - previous : previous - current);

    return (current > previous) ? ((current - previous) >= delta_up)
                                : ((previous - current) >= delta_down);
}

static bool chr_uint24_delta_percent(uint32_t current,
                                     uint32_t previous,
                                     uint16_t delta_up,
                                     uint16_t delta_down)
{
    if (!previous) {
        return true;
    }

