aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
    uint16_t trigger;
    uint32_t difference;

    if (previous > current) {
        trigger = delta_down;
        difference = previous - current;
    } else {
        trigger = delta_up;
        difference = current - previous;
    }

    uint16_t diff_percentage = 100 * ((100 * difference) / previous);

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Unitless trigger: current: %u, previous: %u, delta up: %u, delta down: %u, diff percentage: %u",
        current, previous, delta_up, delta_down, diff_percentage);

    return diff_percentage >= trigger;
}

static bool chr_uint24_delta_trigger_fast(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    if (p->trigger_type) {
        return chr_uint24_delta_percent(*(uint32_t *)p->p_current_value & 0x00ffffff,
                                        *(uint32_t *)p->p_previous_value & 0x00ffffff,
                                        *(uint16_t *)p->p_trigger_delta_up,
                                        *(uint16_t *)p->p_trigger_delta_down);
    } else {
        return chr_uint24_delta_value(*(uint32_t *)p->p_current_value & 0x00ffffff,
                                      *(uint32_t *)p->p_previous_value & 0x00ffffff,
                                      *(uint32_t *)p->p_trigger_delta_up,
                                      *(uint32_t *)p->p_trigger_delta_down);
    }
}
#endif /* SENSOR_PRESENT_DEVICE_INPUT_POWER_ENABLE */


#if SENSOR_PRECISE_TOTAL_DEVICE_ENERGY_USE_ENABLE
static bool chr_uint32_in_fast_region(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    /* uint32 value */
    uint32_t value = *(uint32_t *)p->p_current_value;
    uint32_t fast_cadence_low = *(uint32_t *)p->p_fast_cadence_low;
    uint32_t fast_cadence_high = *(uint32_t *)p->p_fast_cadence_high;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "UINT32 In Fast Region: value: %u, low: %u, high: %u, in_fast_region: %d\n",
        value, fast_cadence_low, fast_cadence_high,
        (fast_cadence_high >= fast_cadence_low)
            ? (value >= fast_cadence_low) && (value <= fast_cadence_high)
            : (value > fast_cadence_low) || (value < fast_cadence_high));

    /* @tagMeshMdlSp Section 4.1.3 */
    return  (fast_cadence_high >= fast_cadence_low)
        ? (value >= fast_cadence_low) && (value <= fast_cadence_high)
        : (value > fast_cadence_low) || (value < fast_cadence_high);
}


static bool chr_uint32_delta_value(uint32_t current,
                                   uint32_t previous,
                                   uint32_t delta_up,
                                   uint32_t delta_down)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Formatted trigger: current: %u, previous: %u, delta up: %u, delta down: %u, diff: %u\n",
        current, previous, delta_up, delta_down, current > previous ? current - previous : previous - current);

    return (current > previous) ? ((current - previous) >= delta_up)
                                : ((previous - current) >= delta_down);
}

static bool chr_uint32_delta_percent(uint32_t current,
                                     uint32_t previous,
                                     uint16_t delta_up,
                                     uint16_t delta_down)
{
    if (!previous) {
        return true;
    }

    uint16_t trigger;
    uint32_t difference;

    if (previous > current) {
        trigger = delta_down;
        difference = previous - current;
    } else {
        trigger = delta_up;
        difference = current - previous;
    }

    uint16_t diff_percentage = 100 * ((100 * difference) / previous);

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
        "Unitless trigger: current: %u, previous: %u, delta up: %u, delta down: %u, diff percentage: %u",
        current, previous, delta_up, delta_down, diff_percentage);

    return diff_percentage >= trigger;
}

static bool chr_uint32_delta_trigger_fast(sensor_cadence_t * p)
{
    NRF_MESH_ASSERT(p);

    if (p->trigger_type) {
        return chr_uint32_delta_percent(*(uint32_t *)p->p_current_value,
                                        *(uint32_t *)p->p_previous_value,
                                        *(uint16_t *)p->p_trigger_delta_up,
                                        *(uint16_t *)p->p_trigger_delta_down);
    } else {
        return chr_uint32_delta_value(*(uint32_t *)p->p_current_value,
                                      *(uint32_t *)p->p_previous_value,
                                      *(uint32_t *)p->p_trigger_delta_up,
                                      *(uint32_t *)p->p_trigger_delta_down);
    }
}
#endif /* SENSOR_PRECISE_TOTAL_DEVICE_ENERGY_USE_ENABLE */


static uint16_t mpid_a_value_marshall(sensor_cadence_t * p, uint8_t * buffer, uint16_t buffer_bytes)
{
    /* @tagMeshMdlSp section 4.2.14 Sensor Status defines the marshalled data format.
     */

    if (buffer_bytes < (SENSOR_MPID_A_BYTES + p->range_value_bytes_allocated))
    {
        return 0;
    }

    /* Copy the data into the buffer after the location of the MPID.
     */
    for (uint16_t i = 0; i < p->range_value_bytes_allocated; i++)
    {
        buffer[i + SENSOR_MPID_A_BYTES] = p->p_current_value[i];
    }

    /* Length is defined as 0-0xF representing 1-16, therefore subtract 1 before storing in the
       marshalled structure.
    */
    sensor_mpid_a_create(p->property_id, p->range_value_bytes_allocated - 1, buffer);

    return SENSOR_MPID_A_BYTES + p->range_value_bytes_allocated;
}


static uint16_t mpid_b_value_marshall(sensor_cadence_t * p, uint8_t * buffer, uint16_t buffer_bytes)
{
    /* @tagMeshMdlSp section 4.2.14 Sensor Status defines the marshalled data format.
     */

    if (buffer_bytes < (SENSOR_MPID_B_BYTES + p->range_value_bytes_allocated))
    {
        return 0;
    }

    /* Copy the data into the buffer after the location of the MPID.
     */
    for (uint16_t i = 0; i < p->range_value_bytes_allocated; i++)
    {
        buffer[i + SENSOR_MPID_B_BYTES] = p->p_current_value[i];
    }

    /* Length is defined as 0-0x7F representing 1-127, 0x7F = 0.
     */
    sensor_mpid_b_create(p->property_id,
                         p->range_value_bytes_allocated
                             ? p->range_value_bytes_allocated - 1 : SENSOR_MPID_B_ZERO_DATA_BYTES,
                         buffer);

    return SENSOR_MPID_B_BYTES + p->range_value_bytes_allocated;
}

static uint8_t * cadence_serialize(sensor_cadence_t * p, uint8_t * p_buffer)
{
    memcpy(p_buffer, &p->property_id, sizeof(uint16_t));
    uint16_t offset = sizeof(uint16_t);
    p_buffer[offset] = p->fast_period_exponent & CADENCE_DIVISOR_MASK;
    p_buffer[offset++] |= ((p->trigger_type & CADENCE_TRIGGER_MASK) << CADENCE_TRIGGER_SHIFT);

    /* For delta vectors, the number of bytes used depends upon the trigger type.
     */
    uint16_t delta_vector_bytes = delta_vector_bytes_get(p->property_id, p->trigger_type);

    for (uint16_t i = 0; i < delta_vector_bytes; i++)
    {
        p_buffer[offset++] = p->p_trigger_delta_down[i];
    }

    for (uint16_t i = 0; i < delta_vector_bytes; i++)
    {
        p_buffer[offset++] = p->p_trigger_delta_up[i];
    }

    p_buffer[offset++] = p->min_interval_exponent;

    /* For range vectors, the number of bytes used is the number of bytes allocated.
     */
    for (uint16_t i = 0; i < p->range_value_bytes_allocated; i++)
    {
        p_buffer[offset++] = p->p_fast_cadence_low[i];
    }

