aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
    for (uint16_t i = 0; i < p->range_value_bytes_allocated; i++)
    {
        p_buffer[offset++] = p->p_fast_cadence_high[i];
    }

    return p_buffer;
}

static void sensor_last_published_set(sensor_cadence_t * p)
{
    memcpy(p->p_previous_value, p->p_current_value, p->range_value_bytes_allocated);
}

static void cadence_unsolicited_status_send(sensor_cadence_t * p)
{
    app_sensor_server_t * p_server = (app_sensor_server_t *)p->p_server;

    if (p->marshalled_bytes == p->value_marshall(p,
                                                 mp_marshalled_data,
                                                 p_server->state.marshalled_list_bytes))
    {
        uint32_t status  = sensor_server_status_publish(&p_server->server.sensor_srv,
                                                        mp_marshalled_data,
                                                        p->marshalled_bytes,
                                                        SENSOR_OPCODE_STATUS);
        if (NRF_SUCCESS == status)
        {
            sensor_last_published_set(p);
        }
        else
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
                  "ERR: publication failed (0x%04x (%d)) = (status)\n",
                  status,
                  status);
        }
    }
}

static void min_interval_limited_status_schedule(sensor_cadence_t * p_cadence)
{
    model_timer_t * p_timer = &p_cadence->min_interval_timer;

    if (model_timer_is_running(p_timer))
    {
        p_cadence->min_interval_publication_pending = true;
    }
    else
    {
        cadence_unsolicited_status_send(p_cadence);

        uint64_t min_us = MS_TO_US(1ull << p_cadence->min_interval_exponent);
        p_timer->timeout_rtc_ticks = (min_us < m_minimum_publish_interval)
                                   ? MODEL_TIMER_TIMEOUT_MIN_TICKS
                                   : MODEL_TIMER_TICKS_GET_US(min_us);
        p_timer->mode = MODEL_TIMER_MODE_SINGLE_SHOT;
        (void) model_timer_schedule(p_timer);
    }
}

static uint16_t marshalled_entry_bytes_get(uint16_t property_id, uint16_t data_bytes)
{
    if ((data_bytes <= MPID_A_MAX_DATA_BYTES) && (property_id <= FORMAT_A_MAX_PROPERTY_ID))
    {
        return SENSOR_MPID_A_BYTES + data_bytes;
    }
    else
    {
        return SENSOR_MPID_B_BYTES + data_bytes;
    }
}

static sensor_cadence_t * cadence_initialize(sensor_cadence_t * p,
                                             uint16_t property_id,
                                             uint16_t range_vector_bytes,
                                             uint16_t delta_vector_bytes,
                                             uint16_t total_bytes)
{
    if (p == NULL)
    {
        return p;
    }

    /* Initialize the instance data.
     */
    memset(p, 0, total_bytes);
    p->property_id = property_id;
    p->range_value_bytes_allocated = range_vector_bytes;
    p->delta_value_bytes_allocated = delta_vector_bytes;
    p->marshalled_bytes  = marshalled_entry_bytes_get(property_id, range_vector_bytes);
    p->value_marshall = ((range_vector_bytes <= MPID_A_MAX_DATA_BYTES) &&
                         (property_id <= FORMAT_A_MAX_PROPERTY_ID))
                              ? mpid_a_value_marshall
                              : mpid_b_value_marshall;

    /* Initialize the pointers.
     * The variable size data area follows the structure.
     */
    uint8_t * p_data = (uint8_t *)&p[1];

    p->p_fast_cadence_low   = &p_data[0];
    p->p_fast_cadence_high  = &p_data[1 * range_vector_bytes];
    p->p_previous_value     = &p_data[2 * range_vector_bytes];
    p->p_current_value      = &p_data[3 * range_vector_bytes];

    p->p_trigger_delta_down = &p_data[4 * range_vector_bytes];
    p->p_trigger_delta_up   = &p->p_trigger_delta_down[1 * delta_vector_bytes];

    return p;
}

static bool cadence_bytes_get(uint16_t property_id,
                              uint16_t * p_range_vector_bytes,
                              uint16_t * p_delta_vector_bytes,
                              uint16_t * p_total_bytes)
{
    *p_range_vector_bytes = range_vector_bytes_get(property_id);
    *p_delta_vector_bytes = delta_vector_bytes_allocated_get(property_id);

    /* There are 6 pointers into the data area, four to buffers of range_vector_bytes, two to buffers
     * of delta_vector_bytes.
     */
    *p_total_bytes = sizeof(sensor_cadence_t)
        + (4 * *p_range_vector_bytes) + (2 * *p_delta_vector_bytes);

    /*  Return success if and only if range_vector_bytes and delta_vector_bytes have non-zero values.
     *  A zero value for either indicates an unsupported property_id.
     */
    return *p_range_vector_bytes && *p_delta_vector_bytes;
}

static sensor_cadence_t * cadence_new(uint16_t property_id)
{
    sensor_cadence_t * p;     /* The cadence instance */
    uint16_t range_vector_bytes;
    uint16_t delta_vector_bytes;
    uint16_t total_bytes;

    if (!cadence_bytes_get(property_id, &range_vector_bytes, &delta_vector_bytes, &total_bytes))
    {
        /* Property ID not supported */
        NRF_MESH_ASSERT(false);
    }

    p = mesh_mem_alloc(total_bytes);

    if (p == NULL)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
              "ERR: could not allocate %d bytes.\n",
              total_bytes);

        NRF_MESH_ASSERT(false);
    }

    return cadence_initialize(p, property_id, range_vector_bytes, delta_vector_bytes, total_bytes);
}

static bool cadence_restart(sensor_cadence_t * p, uint64_t publish_period_us)
{
    /* @tagMeshMdlSp Section 4.1.3:
     * For sensor values in the fast region "... messages shall be published every Publish Period
     * (configured for the model) divided by the Fast Cadence Period Divisor state."
     *
     * "A value represented by the Fast Cadence Period Divisor state (see Section 4.1.3.1) is used
     * as a divider for the Publish Period (configured for the model) if ..." the rate of change
     * exceeds a specified value, the conditions determined by the Status Trigger Type (see Section
     * 4.1.3.2), Status Trigger Delta Down (see Section 4.1.3.3), and the Status Trigger Delta Up
     * (see Section 4.1.3.4).
     */
    if (publish_period_us > 0 && !model_timer_is_running(&p->timer) && p->in_fast_region(p))
    {
        uint64_t period_us = publish_period_us >> p->fast_period_exponent;
        uint64_t min_us;
        uint32_t status;

