aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
        /* @tagMeshMdlSp Section 4.1.3.5:
         * "The Status Min Interval field is a 1-octet value that shall control the minimum interval
         * between publishing two consecutive Sensor Status messages. The value is represented as 2^n
         * milliseconds."
         */
        if (period_us < (min_us = MS_TO_US(1ull << p->min_interval_exponent)))
        {
            period_us = min_us;
        }

        p->timer.timeout_rtc_ticks = (period_us < m_minimum_publish_interval)
                                   ? MODEL_TIMER_TIMEOUT_MIN_TICKS
                                   : MODEL_TIMER_TICKS_GET_US(period_us);

        p->timer.mode = MODEL_TIMER_MODE_SINGLE_SHOT;

        if (NRF_SUCCESS != (status = model_timer_schedule(&p->timer)))
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
                  "ERR: Failed to start cadence timer (%d) = (status).\n",
                  status);
            return false;
        }
    }

    return true;
}

static bool cadence_activate(sensor_cadence_t * p, uint64_t publish_period_us)
{
    NRF_MESH_ASSERT(p);

    /* Abort the instance's cadence timer.
     */
    model_timer_abort(&p->timer);

    /*
     Restart the cadence if necessary.
     */
    return cadence_restart(p, publish_period_us) == NRF_SUCCESS;
}

static sensor_cadence_t * cadence_instance_get(app_sensor_server_t * p_server,
                                               uint16_t property_id)
{

    NRF_MESH_ASSERT(p_server);

    LIST_FOREACH(p_node, p_server->state.p_cadence_list)
    {
        sensor_cadence_t * p;     /* The cadence instance */

        p = PARENT_BY_FIELD_GET(sensor_cadence_t, list_node, p_node);;

        if (property_id == p->property_id)
        {
            /* The property ID maps to the cadence instance at p.
             */
            return p;
        }
    }

    /* The property ID does not map to a cadence instance.
     */
    return NULL;
}

static uint8_t * sensor_cadence_serialize(sensor_cadence_t * p, uint16_t * p_buffered_bytes)
{
    NRF_MESH_ASSERT(p);

    *p_buffered_bytes = cadence_serialized_bytes(p);
    return cadence_serialize(p, p->p_server->p_message_buffer);
}

static void sensor_current_value_set(sensor_cadence_t * p)
{
    uint16_t bytes = p->range_value_bytes_allocated;

    ((app_sensor_server_t *)p->p_server)->sensor_get_cb(p->p_server, p->property_id,
                                                        p->p_current_value, &bytes);

    if (bytes != p->range_value_bytes_allocated)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
              "ERR: sensor_get_cb() failed (%d, %d) = (bytes expected, bytes returned).\n",
              p->range_value_bytes_allocated,
              bytes);

        NRF_MESH_ASSERT(false);
    }
}

/* A common callback services all cadence timers. p_context identifies the cadence instance.
 */
static void cadence_timer_cb(void * p_context)
{
    sensor_cadence_t * p;   /* The cadence instance */

    /* Establish context.
     */
    p = (sensor_cadence_t *)p_context;
    app_sensor_server_t * p_server = (app_sensor_server_t *)p->p_server;
    uint64_t publish_period_us = publish_period_get(p_server->server.sensor_srv.model_handle);

    /* Update the sensor's current value.
     */
    sensor_current_value_set(p);

    if (publish_period_us == 0)
    {
        // No publish period set, should not publish cadence timer status
        return;
    }

    /* Attempt to send an unsolicited status message. Then re-set the cadence timer.
     */
    min_interval_limited_status_schedule(p);
    (void) cadence_activate(p, publish_period_us);
}

static void min_interval_timer_cb(void * p_context)
{
    sensor_cadence_t * p_cadence = (sensor_cadence_t *)p_context;
    model_timer_t * p_timer = &(p_cadence->min_interval_timer);

    if (p_cadence->min_interval_publication_pending)
    {
        p_cadence->min_interval_publication_pending = false;
        cadence_unsolicited_status_send(p_cadence);

        uint64_t min_us = MS_TO_US(1ull << p_cadence->min_interval_exponent);
        p_timer->timeout_rtc_ticks = (min_us < m_minimum_publish_interval)
                                   ? MODEL_TIMER_TIMEOUT_MIN_TICKS
                                   : MODEL_TIMER_TICKS_GET_US(min_us);

        p_timer->mode = MODEL_TIMER_MODE_SINGLE_SHOT;
        (void) model_timer_schedule(p_timer);
    }
    else
    {
        model_timer_abort(p_timer);
    }
}

static void cadence_status_get(sensor_cadence_t * p,
                               sensor_status_msg_pkt_t * p_out,
                               uint16_t * p_out_bytes)
{
    NRF_MESH_ASSERT(p_out_bytes && p_out);

    if (p == NULL)
    {
        *p_out_bytes = 0;
        return;
    }

    *p_out_bytes = p->marshalled_bytes;

    sensor_current_value_set(p);
    if (p->marshalled_bytes != p->value_marshall(p, p_out, *p_out_bytes))
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "ERR:inconsistent state.\n");
        NRF_MESH_ASSERT(false);
    }
}

static inline sensor_cadence_t * cadence_create(app_sensor_server_t * p_server, uint8_t property_index)
{
    uint16_t property_id = p_server->p_sensor_property_array[property_index + 1];
    sensor_cadence_t * p;               /* The cadence instance */

    p = cadence_new(property_id);
    p->fast_period_exponent  = 0;
    p->trigger_type          = 0;
    p->min_interval_exponent = 10;      /* 2^10ms = 512ms */

    p->p_server = p_server;
    p->timer.p_timer_id = &p_server->p_cadence_timer_ids[property_index];
    p->timer.p_context = p;
    p->timer.cb = cadence_timer_cb;
    (void) model_timer_create(&p->timer);

    p->min_interval_timer.p_timer_id = &p_server->p_min_interval_timer_ids[property_index];
    p->min_interval_timer.p_context = p;
    p->min_interval_timer.cb = min_interval_timer_cb;
    (void) model_timer_create(&p->min_interval_timer);

    p_server->state.marshalled_list_bytes += p->marshalled_bytes;

    list_add(&p_server->state.p_cadence_list, &p->list_node);

    return p;
}


/* Entry-point definitions.
 */

uint8_t * sensor_marshalled_entry_parse(uint8_t * p_data_buf, uint8_t * p_format, uint8_t * p_data_length,
                                        uint16_t * p_property_id, uint8_t ** pp_data_value)
{
    NRF_MESH_ASSERT(p_data_buf && p_format && p_data_length && p_property_id && pp_data_value);

    /* figure out which format of marshalled data this is first */
    if ((p_data_buf[0] & FORMAT_MASK) == SENSOR_FORMAT_A_BIT)
    {
        /* It's format a */
        sensor_mpid_a_t * p_mpid = (sensor_mpid_a_t *)p_data_buf;
        /* Length is defined as 0-0xF representing 1-16, therefore + 1 */
        uint8_t length = p_mpid->length + 1;
        *p_property_id = p_mpid->property_id;
        *pp_data_value = &p_data_buf[SENSOR_MPID_A_BYTES];
        *p_data_length = length;
        *p_format = 0;
        return *pp_data_value + length;
    }
    else
    {
        /* It's format b */
        sensor_mpid_b_t * p_mpid = (sensor_mpid_b_t *)p_data_buf;
        /* Length is defined as 0-0x7F representing 1-127, 0x7F = 0 */
        uint8_t length = p_mpid->length;
        length = (length == SENSOR_MPID_B_ZERO_DATA_BYTES) ? 0 : length + 1;
        *p_property_id = p_mpid->property_id;

        *pp_data_value = &p_data_buf[SENSOR_MPID_B_BYTES];
        *p_data_length = length;
        *p_format = 1;
        return *pp_data_value + length;
    }
}

