aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
uint8_t sensor_percentage8_create(uint8_t value, uint8_t b_exp)
{
    NRF_MESH_ASSERT((b_exp == 0) || (b_exp == 1));

    value = (value << 1);
    value |= b_exp;
    return value;
}

uint8_t sensor_percentage8_parse(uint8_t value, uint8_t * b_exp)
{
    NRF_MESH_ASSERT(b_exp);
    *b_exp = value & 0x1;
    value = value >> 1;

    return value;
}

sensor_cadence_t * sensor_cadence_create(uint16_t property_id,
                                         uint8_t * p_buffer,
                                         uint16_t * p_bytes)
{
    uint16_t range_vector_bytes;
    uint16_t delta_vector_bytes;

    NRF_MESH_ASSERT(p_buffer && p_bytes);

    uint16_t available_bytes = *p_bytes;

    if (!cadence_bytes_get(property_id, &range_vector_bytes, &delta_vector_bytes, p_bytes)
     || (*p_bytes > available_bytes))
    {
        return NULL;
    }

    return cadence_initialize((sensor_cadence_t *)p_buffer,
                              property_id,
                              range_vector_bytes,
                              delta_vector_bytes,
                              *p_bytes);
}

sensor_cadence_t * sensor_cadence_to_buffer_deserialize(uint8_t * p_in_buffer,
                                                        uint16_t in_bytes,
                                                        uint8_t * p_out_buffer,
                                                        uint16_t * p_out_bytes)
{
    NRF_MESH_ASSERT(p_in_buffer && p_out_buffer && p_out_bytes);

    if (in_bytes < 2)
    {
        return NULL;
    }

    uint16_t property_id;
    memcpy(&property_id, p_in_buffer, sizeof(uint16_t));
    sensor_cadence_t * p_cadence = sensor_cadence_create(property_id,
                                                         p_out_buffer,
                                                         p_out_bytes);

    uint32_t status = cadence_update(p_cadence, p_in_buffer, in_bytes);

    if (status == NRF_SUCCESS)
    {
        return p_cadence;
    }
    else
    {
        return NULL;
    }
}

void sensor_cadence_to_buffer_serialize(sensor_cadence_t * p, uint8_t * p_buffer, uint16_t * p_bytes)
{
    NRF_MESH_ASSERT(p && p_buffer && p_bytes);

    uint16_t serialized_bytes = cadence_serialized_bytes(p);

    *p_bytes = (serialized_bytes <= *p_bytes) ? serialized_bytes : 0;
    if (*p_bytes)
    {
        (void) cadence_serialize(p, p_buffer);
    }
}

bool sensor_cadence_set(app_sensor_server_t * p_server, const sensor_cadence_set_msg_pkt_t * p_in,
                        uint16_t in_bytes, sensor_cadence_status_msg_pkt_t * p_out,
                        uint16_t * p_out_bytes)
{
    sensor_cadence_t * p;     /* The cadence instance */

    NRF_MESH_ASSERT(p_server && p_in && p_out && p_out_bytes);

    /* Cadence activation depends upon the server's publish period.
     */
    uint64_t publish_period_us = publish_period_get(p_server->server.sensor_srv.model_handle);

    p = cadence_instance_get(p_server, p_in->property_id);
    if (!(p
          && cadence_update(p, (uint8_t *) p_in, in_bytes) == NRF_SUCCESS
          && cadence_activate(p, publish_period_us)))
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
              "ERR: could not activate cadence (0x%04x) = (property_id)\n",
              p_in->property_id);

        /* Any failure should inhibit publication. Thus the return of false on this path. If there is
         * no cadence instance associated with p_in->property_id, a response with the property id is
         * required. In this case, p will be NULL here. If the update failed, the operation should
         * elicit no response as this means that p_in presented a malformed cadence specification.
         * Thus the assignment of 0 to *p_out_bytes where p is not NULL.
         */
        *p_out_bytes = p ? 0 : sizeof(uint16_t);
        memcpy(p_out, (void *)&(p_in->property_id), sizeof(uint16_t));
        return false;
    }

    // data is serialized into sensor buffer via p.
    (void)sensor_cadence_serialize(p, p_out_bytes);

    return true;
}

void sensor_cadence_get(app_sensor_server_t * p_server, uint16_t property_id,
                        sensor_cadence_status_msg_pkt_t * p_out, uint16_t * p_out_bytes)
{
    sensor_cadence_t * p;     /* The cadence instance */

    NRF_MESH_ASSERT(p_server && p_out && p_out_bytes);

    *p_out_bytes = 0;
    p = cadence_instance_get(p_server, property_id);

    if (p == NULL)
    {
        *p_out_bytes = sizeof(uint16_t);
        memcpy(p_out, &property_id, sizeof(uint16_t));
        return;
    }

    // data is stored into server buffer getting access via p.
    (void)sensor_cadence_serialize(p, p_out_bytes);
}


void sensor_initialize(app_sensor_server_t *p_server)
{
    NRF_MESH_ASSERT(p_server);
    m_minimum_publish_interval = MS_TO_US(MODEL_TIMER_PERIOD_MS_GET(MODEL_TIMER_TIMEOUT_MIN_TICKS));

    p_server->state.marshalled_list_bytes = 0;

    /* Create a list of cadence instances, one for each sensor.
     *   Note
     *
     *     the number of sensors is the same as the number of properties identified by the sensor
     *     property array,
     *
     *     the first byte of the sensor property array gives this value,
     *
     *     and the cadence list anchor resides in the server state structure.
     */
    p_server->state.p_cadence_list = NULL;
    for (uint8_t i = 0; i < (uint8_t) p_server->p_sensor_property_array[0]; i++)
    {
        uint16_t property_id;
        sensor_cadence_t * p;     /* The cadence instance */

        switch ((property_id = p_server->p_sensor_property_array[i + 1]))
        {
#ifdef SENSOR_MOTION_SENSED_ENABLE
            case SENSOR_MOTION_SENSED_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint8_in_fast_region;
                p->delta_trigger_fast = chr_uint8_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_MOTION_SENSED_ENABLE */

#ifdef SENSOR_PRESENCE_DETECT_ENABLE
            case SENSOR_PRESENCE_DETECT_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint8_in_fast_region;
                p->delta_trigger_fast = chr_uint8_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRESENCE_DETECT_ENABLE */

#ifdef SENSOR_PRESENT_AMBIENT_TEMPERATURE_ENABLE
        case SENSOR_PRESENT_AMBIENT_TEMPERATURE_PROPERTY_ID:
        {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_int8_in_fast_region;
                p->delta_trigger_fast = chr_int8_delta_trigger_fast;
                break;
        }
#endif /* SENSOR_PRESENT_AMBIENT_TEMPERATURE_ENABLE */

#if SENSOR_PRESENT_DEVICE_INPUT_POWER_ENABLE
        case SENSOR_PRESENT_DEVICE_INPUT_POWER_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint24_in_fast_region;
                p->delta_trigger_fast = chr_uint24_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRESENT_DEVICE_INPUT_POWER_ENABLE */

#if SENSOR_PRESENT_INPUT_CURRENT_ENABLE
        case SENSOR_PRESENT_INPUT_CURRENT_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint16_in_fast_region;
                p->delta_trigger_fast = chr_uint16_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRESENT_INPUT_CURRENT_ENABLE */

#ifdef SENSOR_PRESENT_INPUT_VOLTAGE_ENABLE
            case SENSOR_PRESENT_INPUT_VOLTAGE_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint16_in_fast_region;
                p->delta_trigger_fast = chr_uint16_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRESENT_INPUT_VOLTAGE_ENABLE */

#ifdef SENSOR_DESIRED_AMBIENT_TEMPERATURE_ENABLE
        case SENSOR_DESIRED_AMBIENT_TEMPERATURE_PROPERTY_ID:
        {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_int8_in_fast_region;
                p->delta_trigger_fast = chr_int8_delta_trigger_fast;
                break;
        }
#endif /* SENSOR_DESIRED_AMBIENT_TEMPERATURE_ENABLE */

#ifdef SENSOR_PRECISE_TOTAL_DEVICE_ENERGY_USE_ENABLE
            case SENSOR_PRECISE_TOTAL_DEVICE_ENERGY_USE_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint32_in_fast_region;
                p->delta_trigger_fast = chr_uint32_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRECISE_TOTAL_DEVICE_ENERGY_USE_ENABLE */

#if SENSOR_PRECISE_PRESENT_AMBIENT_TEMPERATURE_ENABLE
            case SENSOR_PRECISE_PRESENT_AMBIENT_TEMPERATURE_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_int16_in_fast_region;
                p->delta_trigger_fast = chr_int16_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRECISE_PRESENT_AMBIENT_TEMPERATURE_ENABLE */

#if SENSOR_PRESENT_AMBIENT_RELATIVE_HUMIDITY_ENABLE
            case SENSOR_PRESENT_AMBIENT_RELATIVE_HUMIDITY_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint16_in_fast_region;
                p->delta_trigger_fast = chr_uint16_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRESENT_AMBIENT_RELATIVE_HUMIDITY_ENABLE */

#if SENSOR_PRESENT_INDOOR_RELATIVE_HUMIDITY_ENABLE
            case SENSOR_PRESENT_INDOOR_RELATIVE_HUMIDITY_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint16_in_fast_region;
                p->delta_trigger_fast = chr_uint16_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRESENT_INDOOR_RELATIVE_HUMIDITY_ENABLE */

#if SENSOR_PRESENT_OUTDOOR_RELATIVE_HUMIDITY_ENABLE
            case SENSOR_PRESENT_OUTDOOR_RELATIVE_HUMIDITY_PROPERTY_ID:
            {
                p = cadence_create(p_server, i);
                p->in_fast_region     = chr_uint16_in_fast_region;
                p->delta_trigger_fast = chr_uint16_delta_trigger_fast;
                break;
            }
#endif /* SENSOR_PRESENT_OUTDOOR_RELATIVE_HUMIDITY_ENABLE */

            default :
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR,
                      "ERR: property id 0x%04x (%d) not supported \n",
                      property_id,
                      property_id);
            }
        }
    }

    mp_marshalled_data = mesh_mem_alloc(p_server->state.marshalled_list_bytes);
}

void sensor_activate(app_sensor_server_t * p_server,
                     uint16_t property_id,
                     sensor_status_msg_pkt_t * p_out,
                     uint16_t * p_out_bytes)
{
    /* Update the sensor value, then set the cadence instance's timer.
     */
    NRF_MESH_ASSERT(p_server && p_out && p_out_bytes);

