aozyumenko/nRF5-SDK-for-Mesh-scg/examples/common/src/app_sensor_utils.c
    sensor_cadence_t * p_cadence = cadence_instance_get(p_server, property_id);
    cadence_status_get(p_cadence, p_out, p_out_bytes);

    if (p_cadence != NULL)
    {
        uint64_t period = publish_period_get(p_server->server.sensor_srv.model_handle);
        (void) cadence_activate(p_cadence, period);
    }
}

app_sensor_server_t * sensor_list_activate(app_sensor_server_t * p_server,
                                           sensor_status_msg_pkt_t * p_out,
                                           uint16_t * p_out_bytes)
{
    NRF_MESH_ASSERT(p_server && p_out && p_out_bytes);

    uint64_t publish_period_us = publish_period_get(p_server->server.sensor_srv.model_handle);
    *p_out_bytes = 0;

    if (!p_server)
    {
        return NULL;
    }

    uint16_t i = 0;
    uint16_t bytes_remaining = p_server->state.marshalled_list_bytes;
    LIST_FOREACH(p_node, p_server->state.p_cadence_list)
    {
        sensor_cadence_t * p;     /* The cadence instance */

        p = PARENT_BY_FIELD_GET(sensor_cadence_t, list_node, p_node);

        sensor_current_value_set(p);
        if (p->marshalled_bytes != p->value_marshall(p, &mp_marshalled_data[i], bytes_remaining))
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "ERR: inconsistent state.\n");
            NRF_MESH_ASSERT(false);
        }

        (void) cadence_activate(p, publish_period_us);
        i += p->marshalled_bytes;
        bytes_remaining -= p->marshalled_bytes;
    }

    *p_out_bytes = p_server->state.marshalled_list_bytes - bytes_remaining;
    memcpy(p_out, mp_marshalled_data, *p_out_bytes);

    return p_server;
}

uint32_t sensor_cadence_publication_abort(app_sensor_server_t * p_server)
{
    NRF_MESH_ASSERT(p_server);

    uint32_t maximum_minimum_publish_interval_ms = 0;

    LIST_FOREACH(p_node, p_server->state.p_cadence_list)
    {
        sensor_cadence_t * p;     /* The cadence instance */

        uint32_t minimum_publish_interval_ms;

        p = PARENT_BY_FIELD_GET(sensor_cadence_t, list_node, p_node);

        minimum_publish_interval_ms = 1ul << p->min_interval_exponent;

        /* Abort the instance's timer.
         */
        model_timer_abort(&p->timer);

        if (minimum_publish_interval_ms > maximum_minimum_publish_interval_ms)
        {
            maximum_minimum_publish_interval_ms = minimum_publish_interval_ms;
        }
    }

    return maximum_minimum_publish_interval_ms;
}

uint32_t sensor_status_publish(app_sensor_server_t * p_server, uint16_t property_id)
{
    sensor_status_msg_pkt_t * p_out = (sensor_status_msg_pkt_t *)p_server->p_message_buffer;
    uint16_t bytes;
    sensor_cadence_t * p = cadence_instance_get(p_server, property_id);

    if (p == NULL)
    {
        return NRF_ERROR_NOT_FOUND;
    }

    cadence_status_get(p, p_out, &bytes);

    uint64_t publish_period_us = publish_period_get(p_server->server.sensor_srv.model_handle);
    (void) cadence_restart(p, publish_period_us);

    if (!p->delta_trigger_fast(p))
    {
        return NRF_SUCCESS;
    }

    min_interval_limited_status_schedule(p);

    return NRF_SUCCESS;
}
